Model: "sequential"
_________________________________________________________________
Layer (type)                 Output Shape              Param #
=================================================================
dense (Dense)                (None, 64)                7552
_________________________________________________________________
dense_1 (Dense)              (None, 16)                1040
_________________________________________________________________
dense_2 (Dense)              (None, 1)                 17
=================================================================
Total params: 8,609
Trainable params: 8,609
Non-trainable params: 0
_________________________________________________________________
Epoch 1/25
407/407 [==============================] - 0s 716us/step - loss: 0.0934 - binary_accuracy: 0.9044
Epoch 2/25
407/407 [==============================] - 0s 704us/step - loss: 0.0700 - binary_accuracy: 0.9187
Epoch 3/25
407/407 [==============================] - 0s 679us/step - loss: 0.0669 - binary_accuracy: 0.9222
Epoch 4/25
407/407 [==============================] - 0s 695us/step - loss: 0.0639 - binary_accuracy: 0.9253
Epoch 5/25
407/407 [==============================] - 0s 750us/step - loss: 0.0614 - binary_accuracy: 0.9282
Epoch 6/25
407/407 [==============================] - 0s 675us/step - loss: 0.0598 - binary_accuracy: 0.9285
Epoch 7/25
407/407 [==============================] - 0s 682us/step - loss: 0.0588 - binary_accuracy: 0.9335
Epoch 8/25
407/407 [==============================] - 0s 696us/step - loss: 0.0581 - binary_accuracy: 0.9329
Epoch 9/25
407/407 [==============================] - 0s 726us/step - loss: 0.0573 - binary_accuracy: 0.9341
Epoch 10/25
407/407 [==============================] - 0s 648us/step - loss: 0.0564 - binary_accuracy: 0.9355
Epoch 11/25
407/407 [==============================] - 0s 668us/step - loss: 0.0564 - binary_accuracy: 0.9362
Epoch 12/25
407/407 [==============================] - 0s 686us/step - loss: 0.0554 - binary_accuracy: 0.9370
Epoch 13/25
407/407 [==============================] - 0s 713us/step - loss: 0.0545 - binary_accuracy: 0.9375
Epoch 14/25
407/407 [==============================] - 0s 654us/step - loss: 0.0535 - binary_accuracy: 0.9377
Epoch 15/25
407/407 [==============================] - 0s 719us/step - loss: 0.0532 - binary_accuracy: 0.9387
Epoch 16/25
407/407 [==============================] - 0s 734us/step - loss: 0.0522 - binary_accuracy: 0.9398
Epoch 17/25
407/407 [==============================] - 0s 709us/step - loss: 0.0521 - binary_accuracy: 0.9389
Epoch 18/25
407/407 [==============================] - 0s 728us/step - loss: 0.0512 - binary_accuracy: 0.9418
Epoch 19/25
407/407 [==============================] - 0s 766us/step - loss: 0.0510 - binary_accuracy: 0.9415
Epoch 20/25
407/407 [==============================] - 0s 720us/step - loss: 0.0509 - binary_accuracy: 0.9415
Epoch 21/25
407/407 [==============================] - 0s 744us/step - loss: 0.0504 - binary_accuracy: 0.9420
Epoch 22/25
407/407 [==============================] - 0s 740us/step - loss: 0.0497 - binary_accuracy: 0.9430
Epoch 23/25
407/407 [==============================] - 0s 752us/step - loss: 0.0503 - binary_accuracy: 0.9431
Epoch 24/25
407/407 [==============================] - 0s 658us/step - loss: 0.0494 - binary_accuracy: 0.9440
Epoch 25/25
407/407 [==============================] - 0s 680us/step - loss: 0.0491 - binary_accuracy: 0.9438
...
407/407 [==============================] - 0s 664us/step - loss: 0.0597 - binary_accuracy: 0.9457
[0.0597141832113266, 0.9456868767738342]
102/102 [==============================] - 0s 747us/step - loss: 0.0771 - binary_accuracy: 0.9229
[0.07705365121364594, 0.9228501319885254]